results/kernel_roundrobin/sysbench_fileio.txt
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      983.82
    writes/s:                     655.88
    fsyncs/s:                     2099.15

Throughput:
    read, MiB/s:                  15.37
    written, MiB/s:               10.25

General statistics:
    total time:                          30.0503s
    total number of events:              112286

Latency (ms):
         min:                                    0.00
         avg:                                    0.27
         max:                                   94.90
         95th percentile:                        1.50
         sum:                                29797.42

Threads fairness:
    events (avg/stddev):           112286.0000/0.00
    execution time (avg/stddev):   29.7974/0.00